---
kind: other
id: Methods.T:Autodesk.Revit.DB.NumericRevisionSettings
source: html/5d3d4af5-cf1b-b0ec-9a15-c8638ca1b52c.htm
---
# NumericRevisionSettings Methods

Determines whether a specified NumericRevisionSettings is the same as 'this'.